def rrules(text):
    if text == '1. Общие положения':
        return ('1. Общие положения', 'rules/1.png')
    if text == '2. Общие обязанности водителей':
        return ('2. Общие обязанности водителей', 'rules/2.png')
    if text == '3. Применение спец. сигналов':
        return ('3. Применение спец. сигналов', 'rules/3.png')
    if text == '4. Обязанности пешеходов':
        return ('4. Обязанности пешеходов', 'rules/4.png')
    if text == '5. Обязанности пассажиров':
        return ('5. Обязанности пассажиров', 'rules/5.png')
    if text == '6. Сигналы светофора и регулировщика':
        return ('6. Сигналы светофора и регулировщика', 'rules/6.png')
    if text == '7. Применение аварийной сигнализации и знака аварийной остановки':
        return ('7. Применение аварийной сигнализации и знака аварийной остановки', 'rules/7.png')
    if text == '8. Начало движения, маневрирование':
        return ('8. Начало движения, маневрирование', 'rules/8.png')
    if text == '9. Расположение транспортных средств на проезжей части':
        return ('9. Расположение транспортных средств на проезжей части', 'rules/9.png')
    if text == '10. Скорость движения':
        return ('10. Скорость движения', 'rules/10.png')
    if text == '11. Обгон, опережение, встречный разъезд':
        return ('11. Обгон, опережение, встречный разъезд', 'rules/11.png')
    if text == '12. Остановка и стоянка':
        return ('12. Остановка и стоянка', 'rules/12.png')
    if text == '13. Проезд перекрестков':
        return ('13. Проезд перекрестков', 'rules/13.png')
    if text == '14. Пешеходные переходы и места остановок маршрутных транспортных средств':
        return ('14. Пешеходные переходы и места остановок маршрутных транспортных средств', 'rules/14.png')
    if text == '15. Движение через железнодорожные пути':
        return ('15. Движение через железнодорожные пути', 'rules/15.png')
    if text == '16. Движение по автомагистралям':
        return ('16. Движение по автомагистралям', 'rules/16.png')
    if text == '17. Движение в жилых зонах':
        return ('17. Движение в жилых зонах', 'rules/17.png')
    if text == '18. Приоритет маршрутных транспортных средств':
        return ('18. Приоритет маршрутных транспортных средств', 'rules/18.png')
    if text == '19. Пользование внешними световыми приборами и звуковыми сигналами':
        return ('19. Пользование внешними световыми приборами и звуковыми сигналами', 'rules/19.png')
    if text == '20. Буксировка механических транспортных средств':
        return ('20. Буксировка механических транспортных средств', 'rules/20.png')
    if text == '21. Учебная езда':
        return ('21. Учебная езда', 'rules/21.png')
    if text == '22. Перевозка людей':
        return ('22. Перевозка людей', 'rules/22.png')
    if text == '23. Перевозка грузов':
        return ('23. Перевозка грузов', 'rules/23.png')
    if text == '24. Дополнительные требования к движению велосипедистов и водителей мопедов':
        return ('24. Дополнительные требования к движению велосипедистов и водителей мопедов', 'rules/24.png')
    if text == '25. Дополнительные требования к движению гужевых повозок, а также к прогону животных ':
        return ('25. Дополнительные требования к движению гужевых повозок, а также к прогону животных ', 'rules/25.png')
    if text == '26. Нормы времени управления транспортным средством и отдыха':
        return ('26. Нормы времени управления транспортным средством и отдыха', 'rules/26.png')
    #####################
    if text == '1. Предупреждающие знаки':
        return ('1. Предупреждающие знаки', 'signs/1.png')
    if text == '2. Знаки приоритета':
        return ('2. Знаки приоритета', 'signs/2.png')
    if text == '3. Запрещающие знаки':
        return ('3. Запрещающие знаки', 'signs/3.png')
    if text == '4. Предписывающие знаки':
        return ('4. Предписывающие знаки', 'signs/4.png')
    if text == '5. Знаки особых предписаний':
        return ('5. Знаки особых предписаний', 'signs/5.png')
    if text == '6. Информационные знаки':
        return ('6. Информационные знаки', 'signs/6.png')
    if text == '7. Знаки сервиса':
        return ('7. Знаки сервиса', 'signs/7.png')
    if text == '8. Знаки дополнительной информации (таблички)':
        return ('8. Знаки дополнительной информации (таблички)', 'signs/8.png')
    if text == '1. Горизонтальная разметка':
        return ('1. Горизонтальная разметка', 'signs/1s.png')
    if text == '2. Вертикальная разметка':
        return ('2. Вертикальная разметка', 'signs/2s.png')
    ###################
    if text == 'Основные положения по допуску транспортных средств к эксплуатации и обязанности должностных лиц по обеспечению безопасности дорожного движения':
        return ('Основные положения по допуску транспортных средств к эксплуатации и обязанности должностных лиц по обеспечению безопасности дорожного движения', 'dopusk/1.png')
    if text == 'Перечень неисправностей и условий, при которых запрещается эксплуатация транспортных средств':
        return ('Перечень неисправностей и условий, при которых запрещается эксплуатация транспортных средств', 'dopusk/2.png')
    ###################
    if text == 'Вариант 1':
        return 1
    if text == 'Вариант 2':
        return 2
    if text == 'Вариант 3':
        return 3





